// Работа с функцией Math
Console.Clear();
//int x = 9.12345;
//int y = Math.Abs(x); //Функция выводит абсолютное значение
//double z = Math.Pow(x, 3); // Функция возведения в степень, первый агрумент что возводим, второй - степень
//double z = Math.Sqrt(x); // Функция извлечения квадратного корня

double x = 9.12345;
double y = Math.Round(x, 2); // Функция округления значений, первый аргумент то что округляем, 
                            //второй - до скольки знаков после запятой





Console.WriteLine(y);
//Console.WriteLine(z);